/** Возможные наименования рейтингов ESRB */
export enum RatingNamesEnum {
  /** возраст 17 и старше: насилие, кровь, бранная речь, наркотики, эротика и тд */
  MATURE = "Mature",
  /** возраст 13 и старше: насилие, небольшое кол-во крови, нечастая бранная речь и тд */
  TEEN = "Teen",
}

/** Перевод возможных наименований рейтингов ESRB */
export enum LocalizedRatingNamesEnum {
  /** возраст 17 и старше: насилие, кровь, бранная речь, наркотики, эротика и тд */
  MATURE = "С 17 лет",
  /** возраст 13 и старше: насилие, небольшое кол-во крови, нечастая бранная речь и тд */
  TEEN = "С 13 лет",
}

/** TODO! Slug возможных наименований рейтингов ESRB */
export enum SlugRatingNamesEnum {
  /** возраст 17 и старше: насилие, кровь, бранная речь, наркотики, эротика и тд */
  MATURE = "mature",
  /** возраст 13 и старше: насилие, небольшое кол-во крови, нечастая бранная речь и тд */
  TEEN = "teen",
}
